STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32U0xx/Include/stm32u0xxxxx.h
/*!< Device Electronic Signature */
#if $U0_256K$
#define PACKAGE_BASE          (0x1FFF6D00UL)        /*!< Package data register base address     */
#define UID_BASE              (0x1FFF6E50UL)        /*!< Unique device ID register base address */
#define FLASHSIZE_BASE        (0x1FFF6EA0UL)        /*!< Flash size data register base address  */
#else
#define PACKAGE_BASE          (0x1FFF3D00UL)        /*!< Package data register base address     */
#define UID_BASE              (0x1FFF3E50UL)        /*!< Unique device ID register base address */
#define FLASHSIZE_BASE        (0x1FFF3EA0UL)        /*!< Flash size data register base address  */
#endif /* U0_256K */

/*!< Bootloader Firmware */
/************ Bootloader Exit Secure Memory Firmware *************/
#if $U0_256K$
#define BL_EXIT_SEC_MEM_BASE    (0x1FFF6000UL)
#else
#define BL_EXIT_SEC_MEM_BASE    (0x1FFF3500UL)
#endif /* U0_256K */

/**
  * @}
  */

/** @addtogroup STM32U0xx_Peripheral_memory_map
  * @{
  */

#define FLASH_BASE            (0x08000000UL)              /*!< FLASH base address */
#define SRAM1_BASE            (0x20000000UL)              /*!< SRAM1 base address */
#if $U0_256K$
#define SRAM1_SIZE_MAX        (0x00008000UL)              /*!< maximum SRAM1 size (up to 32 KBytes) */
#define BKPSRAM2_BASE         (SRAM1_BASE + 0x00008000UL) /*!< SRAM2 BKP(up to 8 KB) base address */
#else
#define SRAM1_SIZE_MAX        (0x00002000UL)              /*!< maximum SRAM1 size (up to 8 KBytes) */
#define BKPSRAM2_BASE         (SRAM1_BASE + 0x00002000UL) /*!< SRAM2 BKP(up to 4 KB) base address */
#endif
#define PERIPH_BASE           (0x40000000UL)              /*!< Peripheral base address */
#define IOPORT_BASE           (0x50000000UL)              /*!< IOPORT base address */

#if $U0_256K$
#define FLASH_SIZE_DEFAULT    0x40000U                    /*!< Flash memory default size */
#else    
#define FLASH_SIZE_DEFAULT    0x10000U                    /*!< Flash memory default size */
#endif    

#define FLASH_SIZE            ((((*((uint16_t *)FLASHSIZE_BASE)) == 0xFFFFU)) ? FLASH_SIZE_DEFAULT : \
                               ((((*((uint16_t *)FLASHSIZE_BASE)) == 0x0000U)) ? FLASH_SIZE_DEFAULT : \
                                (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0xFFFFU)) << 10U)))

/* Internal Flash OTP Area */
#define FLASH_OTP_BASE          (0x1FFF6800UL)            /*!< FLASH OTP (one-time programmable) base address */
#define FLASH_OTP_SIZE          (0x400U)                  /*!< 1024 bytes OTP (one-time programmable)         */

/* Flash system Area */
#define FLASH_SYSTEM_BASE_NS    (0x1FFF0000UL)            /*!< FLASH System non-secure base address  */
#define FLASH_SYSTEM_SIZE       (0x6800U)                 /*!< 26 Kbytes system Flash */

/* Peripheral memory map */
#define APBPERIPH_BASE        PERIPH_BASE
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000UL)

/*!< APB peripherals */
#define TIM2_BASE             (APBPERIPH_BASE + 0x0000UL)
#define TIM3_BASE             (APBPERIPH_BASE + 0x0400UL)
#define TIM6_BASE             (APBPERIPH_BASE + 0x1000UL)
#define TIM7_BASE             (APBPERIPH_BASE + 0x1400UL)
#if $U0_256K$
#define LCD_BASE              (APBPERIPH_BASE + 0x2400UL)
#endif /* U0_256K */
#define RTC_BASE              (APBPERIPH_BASE + 0x2800UL)
#define WWDG_BASE             (APBPERIPH_BASE + 0x2C00UL)
#define IWDG_BASE             (APBPERIPH_BASE + 0x3000UL)
#define SPI2_BASE             (APBPERIPH_BASE + 0x3800UL)
#if $U0_256K$
#define SPI3_BASE             (APBPERIPH_BASE + 0x3C00UL)
#endif /* U0_256K */
#define USART2_BASE           (APBPERIPH_BASE + 0x4400UL)
#define USART3_BASE           (APBPERIPH_BASE + 0x4800UL)
#define USART4_BASE           (APBPERIPH_BASE + 0x4C00UL)
#define I2C1_BASE             (APBPERIPH_BASE + 0x5400UL)
#define I2C2_BASE             (APBPERIPH_BASE + 0x5800UL)
#if $U0_256K$
#define USB_DRD_BASE          (APBPERIPH_BASE + 0x5C00UL)   /*USB FS*/
#define CRS_BASE              (APBPERIPH_BASE + 0x6C00UL)
#endif /* U0_256K */
#define PWR_BASE              (APBPERIPH_BASE + 0x7000UL)
#define DAC1_BASE             (APBPERIPH_BASE + 0x7400UL)
#define OPAMP1_BASE           (APBPERIPH_BASE + 0x7800UL)
#define LPTIM1_BASE           (APBPERIPH_BASE + 0x7C00UL)
#define LPUART1_BASE          (APBPERIPH_BASE + 0x8000UL)
#define LPUART2_BASE          (APBPERIPH_BASE + 0x8400UL)
#define I2C3_BASE             (APBPERIPH_BASE + 0x8800UL)
#if $U0_256K$
#define LPUART3_BASE          (APBPERIPH_BASE + 0x8C00UL)
#define LPTIM3_BASE           (APBPERIPH_BASE + 0x9000UL)
#endif /* U0_256K */
#define LPTIM2_BASE           (APBPERIPH_BASE + 0x9400UL)
#if $U0_256K$
#define USB_DRD_PMAADDR       (APBPERIPH_BASE + 0x9800UL)   /*USB RAM1*/
#define I2C4_BASE             (APBPERIPH_BASE + 0xA000UL)
#endif /* U0_256K */
#define TAMP_BASE             (APBPERIPH_BASE + 0xB000UL)   /*TAMPER (+ BKP Regs)*/
#define SYSCFG_BASE           (APBPERIPH_BASE + 0x10000UL)  /*SYSCFG IF + COMP*/
#if $U0_256K$
#define VREFBUF_BASE          (SYSCFG_BASE + 0x0030UL)
#endif /* U0_256K */
#define COMP1_BASE            (SYSCFG_BASE + 0x0200UL)
#if $U0_256K$
#define COMP2_BASE            (SYSCFG_BASE + 0x0204UL)
#endif /* U0_256K */
#define ADC1_BASE             (APBPERIPH_BASE + 0x12400UL)
#define ADC1_COMMON_BASE      (APBPERIPH_BASE + 0x12708UL)
#define TIM1_BASE             (APBPERIPH_BASE + 0x12C00UL)
#define SPI1_BASE             (APBPERIPH_BASE + 0x13000UL)
#define USART1_BASE           (APBPERIPH_BASE + 0x13800UL)
#define TIM15_BASE            (APBPERIPH_BASE + 0x14000UL)
#define TIM16_BASE            (APBPERIPH_BASE + 0x14400UL)
#define DBGMCU_BASE           (APBPERIPH_BASE + 0x15800UL)

/*!< AHB peripherals */
#define DMA1_BASE             (AHBPERIPH_BASE + 0x0000UL)

#define DMA1_Channel1_BASE    (DMA1_BASE + 0x0008UL)
#define DMA1_Channel2_BASE    (DMA1_BASE + 0x001CUL)
#define DMA1_Channel3_BASE    (DMA1_BASE + 0x0030UL)
#define DMA1_Channel4_BASE    (DMA1_BASE + 0x0044UL)
#define DMA1_Channel5_BASE    (DMA1_BASE + 0x0058UL)
#define DMA1_Channel6_BASE    (DMA1_BASE + 0x006CUL)
#define DMA1_Channel7_BASE    (DMA1_BASE + 0x0080UL)

#if $U0_256K$
#define DMA2_BASE             (AHBPERIPH_BASE + 0x0400UL)

#define DMA2_Channel1_BASE    (DMA2_BASE + 0x0008UL)
#define DMA2_Channel2_BASE    (DMA2_BASE + 0x001CUL)
#define DMA2_Channel3_BASE    (DMA2_BASE + 0x0030UL)
#define DMA2_Channel4_BASE    (DMA2_BASE + 0x0044UL)
#define DMA2_Channel5_BASE    (DMA2_BASE + 0x0058UL)

#endif /* U0_256K */
#define DMAMUX1_BASE           (AHBPERIPH_BASE + 0x0800UL)

