STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32U0xx/Include/stm32u0xxxxx.h
/******************* TIM Instances : Timer input selection ********************/
#define IS_TIM_TISEL_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM2)   || \
                                         ((INSTANCE) == TIM3)   || \
                                         ((INSTANCE) == TIM15)  || \
                                         ((INSTANCE) == TIM16))

/************ TIM Instances : Advanced timers  ********************************/
#define IS_TIM_ADVANCED_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1))

/****************************** TSC Instances *********************************/
#define IS_TSC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == TSC)

/******************** USART Instances : Synchronous mode **********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2) || \
                                     ((INSTANCE) == USART3) || \
                                     ((INSTANCE) == USART4))


/******************** USART Instances : SPI slave mode ************************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                              ((INSTANCE) == USART2) || \
                                              ((INSTANCE) == USART3) || \
                                              ((INSTANCE) == USART4))

/******************** UART Instances : Asynchronous mode **********************/
#if $U0_256K$
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                    ((INSTANCE) == USART2)  || \
                                    ((INSTANCE) == USART3)  || \
                                    ((INSTANCE) == USART4))
#else
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                    ((INSTANCE) == USART2)  || \
                                    ((INSTANCE) == USART3)  || \
                                    ((INSTANCE) == USART4))
#endif /* U0_256K */

/******************** UART Instances : FIFO mode.******************************/
#if $U0_256K$
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                         ((INSTANCE) == USART2)  || \
                                         ((INSTANCE) == LPUART1) || \
                                         ((INSTANCE) == LPUART2) || \
                                         ((INSTANCE) == LPUART3))
#else
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                         ((INSTANCE) == USART2)  || \
                                         ((INSTANCE) == LPUART1) || \
                                         ((INSTANCE) == LPUART2))
#endif /* U0_256K */

/****************** UART Instances : Auto Baud Rate detection *****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                            ((INSTANCE) == USART2))

/*********************** UART Instances : Driver Enable ***********************/
#if $U0_256K$
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                                  ((INSTANCE) == USART2)  || \
                                                  ((INSTANCE) == USART3)  || \
                                                  ((INSTANCE) == USART4)  || \
                                                  ((INSTANCE) == LPUART1) || \
                                                  ((INSTANCE) == LPUART2) || \
                                                  ((INSTANCE) == LPUART3))
#else
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                                  ((INSTANCE) == USART2)  || \
                                                  ((INSTANCE) == USART3)  || \
                                                  ((INSTANCE) == USART4)  || \
                                                  ((INSTANCE) == LPUART1) || \
                                                  ((INSTANCE) == LPUART2))
#endif /* U0_256K */

/********************* UART Instances : Half-Duplex mode **********************/
#if $U0_256K$
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                               ((INSTANCE) == USART2)  || \
                                               ((INSTANCE) == USART3)  || \
                                               ((INSTANCE) == USART4)  || \
                                               ((INSTANCE) == LPUART1) || \
                                               ((INSTANCE) == LPUART2) || \
                                               ((INSTANCE) == LPUART3))
#else
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                               ((INSTANCE) == USART2)  || \
                                               ((INSTANCE) == USART3)  || \
                                               ((INSTANCE) == USART4)  || \
                                               ((INSTANCE) == LPUART1) || \
                                               ((INSTANCE) == LPUART2))
#endif /* U0_256K */

/******************* UART Instances : Hardware Flow control *******************/
#if $U0_256K$
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                           ((INSTANCE) == USART2)  || \
                                           ((INSTANCE) == USART3)  || \
                                           ((INSTANCE) == USART4)  || \
                                           ((INSTANCE) == LPUART1) || \
                                           ((INSTANCE) == LPUART2) || \
                                           ((INSTANCE) == LPUART3))
#else
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                           ((INSTANCE) == USART2)  || \
                                           ((INSTANCE) == USART3)  || \
                                           ((INSTANCE) == USART4)  || \
                                           ((INSTANCE) == LPUART1) || \
                                           ((INSTANCE) == LPUART2))
#endif /* U0_256K */

/******************** UART Instances : Wake-up from Stop mode **********************/
#if $U0_256K$
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == LPUART1)|| \
                                                      ((INSTANCE) == LPUART2)|| \
                                                      ((INSTANCE) == LPUART3))
#else
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == LPUART1)|| \
                                                      ((INSTANCE) == LPUART2))
#endif /* U0_256K */

/************************* UART Instances : LIN mode **************************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2))

/************************* UART Instances : IRDA mode *************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2))

/********************* USART Instances : Smard card mode **********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == USART2))

/****************************** LPUART Instance *******************************/
#if $U0_256K$
#define IS_LPUART_INSTANCE(INSTANCE) (((INSTANCE) == LPUART1) || \
                                      ((INSTANCE) == LPUART2) || \
                                      ((INSTANCE) == LPUART3))
#else
#define IS_LPUART_INSTANCE(INSTANCE) (((INSTANCE) == LPUART1) || \
                                      ((INSTANCE) == LPUART2))
#endif /* U0_256K */

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG)

#if $U0_256K$
/******************************* USB DRD FS PCD Instances *************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_DRD_FS)
#endif /* U0_256K */

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/****************************** OPAMP Instances *******************************/
#define IS_OPAMP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == OPAMP1)

#define IS_OPAMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == OPAMP_COMMON)

#if $U0_256K$
/****************** LCD Instances : All supported instances *****************/
#define IS_LCD_ALL_INSTANCE(INSTANCE)    ((INSTANCE) == LCD)
#endif /* U0_256K */

/******************************************************************************/



/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* $PRODUCTNAME_UC$_H */
/**
  * @}
  */
